{
    "speakers": [
        {
            "sno": "1",
            "name": "Dr. Prasun Chatterjee",
            "post": "Specialist and Assistant Professor of Geriatrics Department, AIIMS New Delhi",
            "description": "Dr. Prasun Chatterjee is one of the very few qualified Geriatrician (specialization in elderly care medicine ) in India. He is currently faculty in AIIMS, New Delhi, Deptt. Of Geriatric Medicine. He has started N.G.O “Healthy Aging India” and is heading it to make it an NGO of International reputation. He is the founder of an intergenerational learning center at Noida Purva Madhyamik Vidyalaya, where educated elderly are mentoring less privileged school children - a 1st of its kind initiative in India. He was given Best Paper Award in National conference in Kolkata 2009 for working on Frailty in elderly, awarded CSIR fellowship to work on Sarcopenia, awarded by Padma Shri Professor V S Natarajan for serving elderly in the community and also \"Bharat Jyoti \"Award 2018 for selfless service to the community.",
            "date": "10-21-2018"
        },
        {
            "sno": "2",
            "name": "Lt. Gen. Satish Dua",
            "post": "Lieutenant General Satish Dua, PVSM, UYSM, SM, VSM is the current Chief of Integrated Defence Staff to the Chairman Chiefs of Staff Committee of the Indian Armed Forces",
            "description": "Lt. was commissioned into 8 Jammu and Kashmir Light Infantry (Siachen) in December 1979. He is considered as a counter-terrorism specialist and has held various important command, staff and instructor appointments during his career. He has commanded a battalion and a brigade in counterterrorism operations in Jammu and Kashmir and the XV Corps (Srinagar) (2015-2016). As a Major General of Assam Rifles, he was instrumental in raising a new formation termed IGAR (East) in Northeast India. He has held various staff appointments including Colonel MS (Complaints) in Military Secretary Branch; Brigade Major of Kargil Brigade; Brigadier General Staff (Operations) of XVI Corps (Nagrota); Deputy Director General in Weapon Equipment Directorate; Additional Director General (Procurement) in Master General of Ordnance Branch. During his career, he has been awarded the Vishisht Seva Medal, Sena Medal, the Uttam Yudh Seva Medal (2017) and Param Vishisht Seva Medal (2018) for his service.",
            "date": "10-21-2018"
        },
        {
            "sno": "3",
            "name": "Mr. Achanta Sharath Kamal",
            "post": "Professional Indian table tennis player (Current World Rank: 32)",
            "description": "Achanta Sharath Kamal is a professional table tennis player from Tamil Nadu, India. He is the second Indian table tennis player to become 8 times national champion. His current world rank is 35, as of September 2018. He has won the men's singles gold in the 16th Commonwealth table tennis championship held at Kuala Lumpur in 2004. He has won the US Open Table Tennis Men's championships held at Grand Rapids, Michigan in July 2010. He is the winner of 4 gold, 2 bronze and a silver medal in Commonwealth games. He recently bagged bronze medal for India in the Asian games 2018. He is a recipient of the Arjuna award for the year 2004. He currently lives in Düsseldorf, Germany. He is also employed with the Indian Oil Corporation as an officer.",
            "date": "10-21-2018"
        },
        {
            "sno": "4",
            "name": "Mr. Ashish Jaiswal",
            "post": "Author of \"Fluid\", \"True Dummy\" and \"How to Reform a Business School\"",
            "description": "Ashish Jaiswal is a writer and an internationally renowned expert on education. He is currently a fellow at the Oxford Centre for Higher Education Policy Studies, UK and the author of upcoming book Fluid: The Approach Applied by Geniuses Over Centuries. Ashish has spoken around the world on the new age reforms required in our learning and thinking in the light of mega changes currently being witnessed in technology, markets, and human behavior. Ashish is also the founder of iHER (India for Higher Education Reforms), a community platform with over 100,000 of students, educationists and policymakers with the aim to discuss transformative ideas on education. Ashish holds a Ph.D. and a Master's from the University of Oxford in the field of education.",
            "date": "10-21-2018"
        },
        {
            "sno": "5",
            "name": "Mr. Divyanshu Damani",
            "post": "Entrepreneur, social media influencer, public figure",
            "description": "Divyanshu Damani is a social media influencer, entrepreneur, public speaker, vlogger, traveler, scuba diver, skier, and a believer. He currently has a family of over 200K followers on social media and has inspired thousands of young people across the globe. He is a TEDx speaker and actively speaks at Josh Talks. He has done spoken at over 50 other speaking platforms.",
            "date": "10-21-2018"
        },
        {
            "sno": "6",
            "name": "Ms. Neeti Leekha Chhabra",
            "post": "Founder & President of NGO Yes to Life; Faculty-HR & OB; Corporate Trainer; Motivational Speaker",
            "description": "Founder and president of an NGO 'Yes to Life', Neeti is working relentlessly towards spreading awareness for breast cancer and supporting those affected by it. The young breast cancer winner started the NGO in 2014 with an aim to contribute to lowering the mortality rate of those diagnosed with it. A professor by profession, she left her full-time dream job to pursue her inner calling. She now balances her time between Yes to Life and her career as a corporate trainer & professor. Also an author, she writes about life, positivity, and happiness. Neeti is a public speaker who doesn't only talk about cancer awareness but also about stress management and happier lifestyles. She has delivered awareness sessions to diverse audiences at various places, including LinkedIn, IIM Indore.",
            "date": "10-21-2018"
        },
        {
            "sno": "7",
            "name": "Ms. Rinku Sawhney",
            "post": "Success coach from over a decade",
            "description": "Rinku is a Social Impact Entrepreneur, a Personal Excellence & Mind-shift Coach. She has co-founded Elevated Minds, which is a start-up committed to help people rise above mediocrity and become the masters of their own lives. Over 5000 people have experienced Rinku's signature live events. Her work has enabled people to get clarity and identify roadblocks, that have held them back from achieving success. Rinku firmly believes that each and every human is unique and special and that we are all born to be successful. She is also the author of an upcoming book, “My Life; I Decide”. In her own small way, Rinku believes in impacting the world and leaving it a slightly better place.",
            "date": "10-21-2018"
        },
        {
            "sno": "8",
            "name": "Swami Prem Parivartan AKA Peepal Baba",
            "post": "Founder- Give Me Trees Trust | Nature Enthusiast | Green Activist",
            "description": "Swami Prem Parivartan (aka Peepal Baba) is the founder trustee of the environmental movement \"Give Me Trees\" Trust. He has been planting trees for the last 41 years since he was 11 years old. He is fondly called 'Peepal Baba' because he has devoted his entire life towards the planting and preservation of Peepal trees, facilitating the plantation of more than 10 million Peepal trees all across India. He is the founder of Give Me Trees Trust, which is one of the largest tree plantation and preservation movements in India. Give Me Trees Trust has planted more than 20 million trees all across India in the last 41 years. He has received numerous awards, including the Unsung Heroes Award presented to him by John Abraham.",
            "date": "10-21-2018"
        },
        {
            "sno": "9",
            "name": "Gauranga Das",
            "post": "Leader at Govardhan Eco Village and Preacher at ISKCON",
            "description": "With an undergraduate degree in Metallurgical Engineering from the reputed IIT Mumbai, he is leading the Govardhan Eco Village Facilities, Nursery and the Green Buildings Construction(CSEB). He has bagged many awards for GEV by presenting the Symbiotic waste management systems followed in GEV in various reputed conferences like CII, SKOCH and FICCI. He is instrumental in bringing up the new Vedic culture and education center in GEV. He is also currently leading the much awaited Vrindavan Biodiversity project at GEV.",
            "date": "03/26/2017"
        },
        {
            "sno": "10",
            "name": "Karan Chitra Deshmukh",
            "post": "DRUMMER | PERCUSSIONIST | MUSICIAN",
            "description": "Karan Chitra Deshmukh is a percussionist, electronic fusion artiste based in Mumbai. Karan Chitra Deshmukh has established himself as a spokesman for a generation of music that incorporates electronica, dance grooves, and classical Indian sound. He is an artist with a versatility of Indian music, tabla, percussion, and Western drumming -- who plays a unique hybrid East-West drum set up. He's an open- minded musician who improvises rock, electronica, and Indian classical music. A dazzling percussionist, an accessible entertainer.",
            "date": "03/26/2017"
        },
        {
            "sno": "11",
            "name": "Mahesh Bhat",
            "post": "Photographer and Film Maker",
            "description": "He has been commissioned by publications from over twenty countries in his career which has spanned over 30 years. His work has spanned a variety of genres such as advertising, interior and architecture, corporate, portraiture, documentary and photojournalism. Along with his professional practice, he enjoys working at \"Srishti Institute of Art, Design and Technology-Bangalore.\" He was one of the four photographers to work on the 'Re-Imagining the People of India' under the aegis of the inaugural Neel Dongre Grant (2013). His work has featured in prominent exhibitions like CLICK - Contemporary Photography in India at Vadhera Gallery -Delhi and London (2008), Goa International Photo Festival (2015), Dali International Photo Festival, China (2015) and India Photo Festival at Hyderabad (2015) to name a few.",
            "date": "03/26/2017"
        },
        {
            "sno": "12",
            "name": "Manan Desai",
            "post": "Stand-up comedian and Founder of The Comedy Factory",
            "description": "Manan Desai is a popular Indian Stand-up comedian, who is appeared in the popular comedy show Comedy Night Bachao Season 2. He gave up a career as a Radio Jockey after working for 7 years as a prime-time jock in some of the leading private radio stations of Gujarat. All for the passion of bringing live comedy entertainment in Gujarat. As a performer, Manan loves to weave content that talks about the cultural nuances of India. He strongly believes that every aspect of our diverse culture has a lot of comedy to offer.He is one of the founders of The Comedy Factory.",
            "date": "03/26/2017"
        },
        {
            "sno": "13",
            "name": "Mathew Jose",
            "post": "Entrepreneur and Founder at Paper Man",
            "description": "Mathew Jose is a social entrepreneur, who is championing the cause of recycling by his social venture called Paperman. This agency is almost making a paper revolution in Chennai, by connecting over 280 local scrap dealers to 3,500 households to ensure scrap is collected, weighed and paid. Paperman charges the kabaddi Wala 5 percent of the total value of each transaction as revenues. They have also connected NGO's to people who are willing to donate papers and plastics. The NGO's, in turn, utilizes this to raise funds by selling them.He has also featured in Forbes 30 under 30 India.",
            "date": "03/26/2017"
        },
        {
            "sno": "14",
            "name": "Rajani Thindiath",
            "post": "Editor and Author at Tinkle",
            "description": "She has years of experience in publishing, she has ideated, plotted and scripted original stories of fiction; researched, written and edited features; conceived new comic characters; and given a fresh look to an existing magazine/book.In the course of this journey, she has been a writer/sub writer at Navneet publications for four years, an assistant editor at Tinkle(India's most popular English -language monthly comics magazine for children) over 4 years and took over as magazines editor in 2011",
            "date": "03/26/2017"
        },
        {
            "sno": "15",
            "name": "Samit Choksi",
            "post": "Innovator and Founder at Thinkphi",
            "description": "Samit Choksi is the Co-founder of Thinkphi a clean technology company innovating sustainable engineered products that help intelligently conserve water, energy, and waste. Prior to this Samit has co-founded and worked at various start-ups in India and Silicon Valley as a software architect and developer. He has worked closely on product development at a Fortune 500 data base technology company while living in the USA. Spending most of his life outside India, upon moving back he was motivated to build products that aspire to have global standards in quality and finish. With a love for nature and the environment, he is currently realizing his dream of building simple but intelligent products that influence user behavior to conserve earth's natural resources. Thinkphi's first product, Thinkphi is a patented system which smartly converges water harvesting and renewable energy for open spaces in smart cities, industries, or large campuses.",
            "date": "03/26/2017"
        },
        {
            "sno": "16",
            "name": "Sanjeev Newar",
            "post": "Analytics and Risk Management",
            "description": "He is an MBA graduate from IIM Calcutta and engineering undergrad from IIT Guwahati - two of the most respected institutions of India. Professionally he is an expert in Analytics and Risk Management. In past 14 years of his career, he has undertaken several projects of social, national and global importance. He is also associated with IIT Kanpur in nurturing budding entrepreneurs and indigenous innovation from grass-root level. He is the CEO of Aarsh Management which was listed in 20 Most Promising Risk Management Solution Providers of the world by CIO Review.",
            "date": "03/26/2017"
        }
    ],
    "talks": [
        {
            "sno": "1",
            "title": "Your most powerful weapon that you're not using! | Mr. Divyanshu Damani | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/sCMulrwmN5w",
            "speaker": "Mr. Divyanshu Damani",
            "date": "10-21-2018",
            "views": "10,011 views",
            "likes": "349",
            "description": "Mr. Divyanshu Damani, Entrepreneur, social media influencer, public figure. He aims to empower his audience which consists of more than 200k followers on Facebook and more than 30 million views on the videos. His content brings together people from various parts of the landscape and together they have formed a family of netizens consisting of more than 200k members. In this talk, he talks about the power of words and cites many real-life examples to clarify the audience about how a careful selection of words can turnaround things. Divyanshu Damani is a social media influencer, entrepreneur, public speaker, vlogger, traveler, scuba diver, skier, and a believer. He currently has a family of over 200K followers on social media and has inspired thousands of young people across the globe. He is a TEDx speaker and actively speaks at Josh Talks. He has done spoken at over 50 other speaking platforms. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "2",
            "title": "Why Me or Wow Me! | Ms. Neeti Leekha Chhabra | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/vIkRT1xF8NY",
            "speaker": "Ms. Neeti Leekha Chhabra",
            "date": "10-21-2018",
            "views": "24,520 views",
            "likes": "693",
            "description": "Ms. Neeti Leekha Chhabra, Founder & President of NGO Yes to Life; Faculty-HR & OB; Corporate Trainer and a breast cancer winner. In this talk, she talks about her journey from Why me to Wow me as a breast cancer patient and then as a face of million other patients, helping them recover with the disease. Founder and president of an NGO 'Yes to Life', Neeti is working relentlessly towards spreading awareness for breast cancer and supporting those affected by it. The young breast cancer winner started the NGO in 2014 with an aim to contribute to lowering the mortality rate of those diagnosed with it. A professor by profession, she left her full-time dream job to pursue her inner calling. She now balances her time between Yes to Life and her career as a corporate trainer & professor. Also an author, she writes about life, positivity, and happiness. Neeti is a public speaker who doesn't only talk about cancer awareness but also about stress management and happier lifestyles. She has delivered awareness sessions to diverse audiences at various places, including LinkedIn, IIM Indore. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "3",
            "title": "Barriers of progress | Swami Prem Parivartan AKA Peepal Baba | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/kLqtkArrHTA",
            "speaker": "Swami Prem Parivartan AKA Peepal Baba",
            "date": "10-21-2018",
            "views": "8,344 views",
            "likes": "422",
            "description": "Swami Prem Parivartan, popularly known as Peepal Baba, who is the founder trustee of the environmental movement Give Me Trees Trust, which is one of the largest tree plantation and preservation movements in India. He has been planting trees for the last 41 years since he was 11 years old. He is fondly called 'Peepal Baba' because he has devoted his entire life towards the planting and preservation of Peepal trees. Facilitating the plantation of more than 10 million Peepal trees all across India, he has received numerous awards. In his talk, he discussed about the barriers of progress and explained the importance of planting trees and sustainable development by sharing his own motivation of the same. Swami Prem Parivartan (aka Peepal Baba) is the founder trustee of the environmental movement \"Give Me Trees\" Trust. He has been planting trees for the last 41 years since he was 11 years old. He is fondly called 'Peepal Baba' because he has devoted his entire life towards the planting and preservation of Peepal trees, facilitating the plantation of more than 10 million Peepal trees all across India. He is the founder of Give Me Trees Trust, which is one of the largest tree plantation and preservation movements in India. Give Me Trees Trust has planted more than 20 million trees all across India in the last 41 years. He has received numerous awards, including the Unsung Heroes Award presented to him by John Abraham. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "4",
            "title": "How a genius mind breaks the boxes of education | Mr. Ashish Jaiswal | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/w8S_Lc1eAE4",
            "speaker": "Mr. Ashish Jaiswal",
            "date": "10-21-2018",
            "views": "18,998 views",
            "likes": "236",
            "description": "Mr. Ashish Jaiswal, Author of international bestsellers \"Fluid\", \"True Dummy\" and \"How to reform a business school\". He holds a doctorate and a master's in the field of education from the University of Oxford and is currently a research fellow at the Oxford Centre for Higher Education Policy Studies (OxCHEPS). With the use of many creative ways during his talk, Dr. Jaiswal lays importance on thinking outside the box. His talk ignites curiosity in the young minds to think deeply about their passion and beyond the conventional thought process. Ashish Jaiswal is a writer and an internationally renowned expert on education. He is currently a fellow at the Oxford Centre for Higher Education Policy Studies, UK and the author of upcoming book Fluid: The Approach Applied by Geniuses Over Centuries. Ashish has spoken around the world on the new age reforms required in our learning and thinking in the light of mega changes currently being witnessed in technology, markets, and human behavior. Ashish is also the founder of iHER (India for Higher Education Reforms), a community platform with over 100,000 of students, educationists and policymakers with the aim to discuss transformative ideas on education. Ashish holds a Ph.D. and a Master's from the University of Oxford in the field of education. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "5",
            "title": "Perseverance of a Paddler | Mr. Achanta Sharath Kamal | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/fCX5nVkjAww",
            "speaker": "Mr. Achanta Sharath Kamal",
            "date": "10-21-2018",
            "views": "10,287 views",
            "likes": "396",
            "description": "Mr. Achanta Sharath Kamal is a professional table-tennis player and a well-known sports personality. He has a long list of achievements. He represented India in the 2004 Olympics and 2006 Asian Games at Qatar. He also won the gold medal at the 2006 Commonwealth Games in Melbourne. In 2008, he was the only Indian Men's Table Tennis player to be selected for the Beijing Olympics. He along with Subhajit Saha won the Men's Doubles gold at the 2010 Commonwealth Games in New Delhi. He also qualified for Rio Olympics in 2016. A recipient of the Arjuna award for the year 2004, Mr. Sharath currently lives in Chennai. Over the past few years, he has been playing in the European league. He is also a chief manager at the Indian Oil Corporation. His current world rank is 31, as of October 2018. He is the second Indian table tennis player to become 8 times national champion after Kamlesh Mehta. In his talk, Mr. Achanta shares his journey on how despite being from a humble background he made his own way. He shares all the ups and downs of his life which are definitely an inspiration for millions of people worldwide. Achanta Sharath Kamal is a professional table tennis player from Tamil Nadu, India. He is the second Indian table tennis player to become 8 times national champion. His current world rank is 35, as of September 2018. He has won the men's singles gold in the 16th Commonwealth table tennis championship held at Kuala Lumpur in 2004. He has won the US Open Table Tennis Men's championships held at Grand Rapids, Michigan in July 2010. He is the winner of 4 gold, 2 bronze and a silver medal in Commonwealth games. He recently bagged bronze medal for India in the Asian games 2018. He is a recipient of the Arjuna award for the year 2004. He currently lives in Düsseldorf, Germany. He is also employed with the Indian Oil Corporation as an officer. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "6",
            "title": "Are you a People Pleaser? | Ms. Rinku Sawhney | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/l7GHVBcJzaU",
            "speaker": "Ms. Rinku Sawhney",
            "date": "10-21-2018",
            "views": "416,683 views",
            "likes": "13K",
            "description": "Ms. Rinku is a Social Impact Entrepreneur, a Personal Excellence & Mind-shift Coach. She has co-founded Elevated Minds, which is a start-up committed to helping people rise above mediocrity and become the masters of their own lives. Her work has enabled people to get clarity and identify roadblocks, that have held them back from achieving success. In this talk, she delivers an eye-opening speech and touches the fine line between being kind and a people pleaser by sharing examples from her own life. Rinku is a Social Impact Entrepreneur, a Personal Excellence & Mind-shift Coach. She has co-founded Elevated Minds, which is a start-up committed to help people rise above mediocrity and become the masters of their own lives. Over 5000 people have experienced Rinku's signature live events. Her work has enabled people to get clarity and identify roadblocks, that have held them back from achieving success. Rinku firmly believes that each and every human is unique and special and that we are all born to be successful. She is also the author of an upcoming book, “My Life; I Decide”. In her own small way, Rinku believes in impacting the world and leaving it a slightly better place. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "7",
            "title": "Why a soldier does what he does? | Lt. Gen. Satish Dua | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/qaBiiGlfcgk",
            "speaker": "Lt. Gen. Satish Dua",
            "date": "10-21-2018",
            "views": "421,247 views",
            "likes": "14K",
            "description": "Lieutenant General Satish Dua, PVSM, UYSM, SM, VSM is the Chief of Integrated Defence Staff to the Chairman, Chiefs of Staff Committee (CISC). The Integrated Staff is responsible for synergizing capability development, perspective planning and jointness amongst services.A counter-terrorism specialist, General Dua has commanded his Unit as well as a Brigade in active militancy in Jammu & Kashmir in Line of Control / Counter Terrorism environment. As General Officer Commanding, he raised a new Division sized Counter Terrorism formation of Assam Rifles in the North East called Inspector General of Assam Rifles (IGAR-EAST) to coordinate operations in three states of North East. Lieutenant General Satish Dua was at the helm of affairs as Chinar Corps Commander in Kashmir during the tumultuous years of 2015-2016, when momentous operations were executed, defined largely by the surgical strikes and the huge unrest post elimination of Burhan Wani. The General was also a commando instructor as a Captain and Indian Defence Attaché in Vietnam, Cambodia and Laos as Colonel. He has also tenanted important appointment dealing with both capital and revenue procurement of weapons & equipment. The General is also the Colonel of the JAK LI Regiment which has 100% troops from the state of Jammu and Kashmir. The General is a keen sportsman, fond of riding and an adventure sports enthusiast to include skydiving, skiing, parachute jumping and mountain biking.\r\n\r\nIn this talk at TEDxIITIndore, Lt. Gen. Dua talks about what motivates a soldier to stand boldly at the borders away from his family and serve the nation. Lt. was commissioned into 8 Jammu and Kashmir Light Infantry (Siachen) in December 1979. He is considered as a counter-terrorism specialist and has held various important command, staff and instructor appointments during his career.\r\n\r\nHe has commanded a battalion and a brigade in counterterrorism operations in Jammu and Kashmir and the XV Corps (Srinagar) (2015-2016). As a Major General of Assam Rifles, he was instrumental in raising a new formation termed IGAR (East) in Northeast India. He has held various staff appointments including Colonel MS (Complaints) in Military Secretary Branch; Brigade Major of Kargil Brigade; Brigadier General Staff (Operations) of XVI Corps (Nagrota); Deputy Director General in Weapon Equipment Directorate; Additional Director General (Procurement) in Master General of Ordnance Branch. During his career, he has been awarded the Vishisht Seva Medal, Sena Medal, the Uttam Yudh Seva Medal (2017) and Param Vishisht Seva Medal (2018) for his service. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "8",
            "title": "Euthanasia - the right RIGHT? | Dr. Prasun Chatterjee | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/rjDhflvXXJM",
            "speaker": "Dr. Prasun Chatterjee",
            "date": "10-21-2018",
            "views": "2,275 views",
            "likes": "50",
            "description": "Dr. Prasun Chatterjee, Specialist and Assistant Professor of Geriatrics Department, AIIMS New Delhi. In this talk, Dr. Chatterjee shares the intrinsic details on a highly sensitive topic - “Euthanasia”. With references from many real-life cases, like that of Aruna Shaunbag, Dr. Chatterjee's talk revolves around safeguarding the patients and taking care of compassionate death with respect and proper protection. Dr. Prasun Chatterjee is one of the very few qualified Geriatrician (specialization in elderly care medicine ) in India. He is currently faculty in AIIMS, New Delhi, Deptt. Of Geriatric Medicine. He has started N.G.O “Healthy Aging India” and is heading it to make it an NGO of International reputation. He is the founder of an intergenerational learning center at Noida Purva Madhyamik Vidyalaya, where educated elderly are mentoring less privileged school children - a 1st of its kind initiative in India. He was given Best Paper Award in National conference in Kolkata 2009 for working on Frailty in elderly, awarded CSIR fellowship to work on Sarcopenia, awarded by Padma Shri Professor V S Natarajan for serving elderly in the community and also \"Bharat Jyoti \"Award 2018 for selfless service to the community. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "9",
            "title": "Harmonising with Nature | Gauranga Das | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/Gf27FVPfibM",
            "speaker": "Gauranga Das'",
            "date": "26-03-2017",
            "views": "1,653 views",
            "likes": "60",
            "description": "Villages were the custodians of tradition and culture in Vedic times and so we recreated a Vedic village modelled after Vrindavan in Galtare village, Wada Taluka, Palghar District in Maharashtra. The.A humble effort made at Goverdhan Eco Village, near Mumbai over 100 Acres of land. and create a win win solution between urban population and rural population of India. Since more than 65 percent of India's population live in villages they decided to have a strategy for transforming the villages in India. They created an ecosystem of harmony with nature by building a green infrastructure based on Organic Farming, Green Buildings, Water Conservation, Alternative Energy, Waste Management, Soil Bio Technology, Animal care etc. With an undergraduate degree in Metallurgical Engineering from the reputed IIT Mumbai, he is leading the Govardhan Eco Village Facilities, Nursery and the Green Buildings Construction(CSEB). He has bagged many awards for GEV by presenting the Symbiotic waste management systems followed in GEV in various reputed conferences like CII, SKOCH and FICCI. He is instrumental in bringing up the new Vedic culture and education center in GEV. He is also currently leading the much awaited Vrindavan Biodiversity project at GEV. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "10",
            "title": "Everything you touch around and everything you play is music | Karan Chitra Deshmukh | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/UPDCmOB8Mo4",
            "speaker": "Karan Chitra Deshmukh",
            "date": "26-03-2017",
            "views": "98,485 views",
            "likes": "2.5K",
            "description": "Karan Chitra Deshmukh is a percussionist, electronic fusion artiste based in Mumbai. He never took classes as he was too scared of being beaten up for not performing well. Part of multiple projects, he comes with no background in music. He is famous for his instrumental Tabla cover for 'Game of Thrones' theme song. Karan Chitra Deshmukh is a percussionist, electronic fusion artiste based in Mumbai. Karan Chitra Deshmukh has established himself as a spokesman for a generation of music that incorporates electronica, dance grooves, and classical Indian sound. He is an artist with a versatility of Indian music, tabla, percussion, and Western drumming -- who plays a unique hybrid East-West drum set up. He's an open- minded musician who improvises rock, electronica, and Indian classical music. A dazzling percussionist, an accessible entertainer. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "11",
            "title": "Tragedies and Unsung Heroes | Impact of Photography | Mahesh Bhat | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/U2PQGHnLmys",
            "speaker": "Mahesh Bhat",
            "date": "26-03-2017",
            "views": "209 views",
            "likes": "5",
            "description": "This talk encompasses the impact of Honest Photography as a medium to tell stories. People let photographers into their life sometimes, simply hoping that these photographs can change their life He has been commissioned by publications from over twenty countries in his career which has spanned over 30 years. His work has spanned a variety of genres such as advertising, interior and architecture, corporate, portraiture, documentary and photojournalism. Along with his professional practice, he enjoys working at \"Srishti Institute of Art, Design and Technology-Bangalore.\" He was one of the four photographers to work on the 'Re-Imagining the People of India' under the aegis of the inaugural Neel Dongre Grant (2013). His work has featured in prominent exhibitions like CLICK - Contemporary Photography in India at Vadhera Gallery -Delhi and London (2008), Goa International Photo Festival (2015), Dali International Photo Festival, China (2015) and India Photo Festival at Hyderabad (2015) to name a few. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "12",
            "title": "How to take the right decision at the right time? | Impact of time | Manan Desai | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/2u4-1f5Cysw",
            "speaker": "Manan Desai",
            "date": "26-03-2017",
            "views": "29,692 views",
            "likes": "576",
            "description": "When someone makes a decision, he is really diving into a strong current that will take him to places he had never dreamed of when he first made the decision.Stay committed to your decisions. Stop looking for people's approval. Manan Desai is a popular Indian Stand-up comedian, who is appeared in the popular comedy show Comedy Night Bachao Season 2. He gave up a career as a Radio Jockey after working for 7 years as a prime-time jock in some of the leading private radio stations of Gujarat. All for the passion of bringing live comedy entertainment in Gujarat. As a performer, Manan loves to weave content that talks about the cultural nuances of India. He strongly believes that every aspect of our diverse culture has a lot of comedy to offer.He is one of the founders of The Comedy Factory. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "13",
            "title": "Are you eating your own toothbrush? | Mathew Jose | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/TnsHtsbuLhA",
            "speaker": "'Mathew Jose",
            "date": "26-03-2017",
            "views": "657 views",
            "likes": "11",
            "description": "The talk explains how millions of people across the world eat their toothbrush everyday. It will address plastic pollution and the impacts of it. The talk aims to question our attitude of throwing away. It will throw light on the solution that could positively prevent wastage and will call for action to people to engage Mathew Jose is a social entrepreneur, who is championing the cause of recycling by his social venture called Paperman. This agency is almost making a paper revolution in Chennai, by connecting over 280 local scrap dealers to 3,500 households to ensure scrap is collected, weighed and paid. Paperman charges the kabaddi Wala 5 percent of the total value of each transaction as revenues. They have also connected NGO's to people who are willing to donate papers and plastics. The NGO's, in turn, utilizes this to raise funds by selling them.He has also featured in Forbes 30 under 30 India. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "14",
            "title": "How to tell a story? | The Storytelling Bug | Rajani Thindiath | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/xgp8TKA4JjQ",
            "speaker": "Rajani Thindiath",
            "date": "26-03-2017",
            "views": "1,324 views",
            "likes": "27",
            "description": "Each creative person, each writer will have their own form of discipline. You, who have chosen a field that many would term non-creative would too. And yet what is creativity? What is storytelling? It is narrating something fictional or factual with a beginning, middle and end. It is thinking out of the box. She has years of experience in publishing, she has ideated, plotted and scripted original stories of fiction; researched, written and edited features; conceived new comic characters; and given a fresh look to an existing magazine/book.In the course of this journey, she has been a writer/sub writer at Navneet publications for four years, an assistant editor at Tinkle(India's most popular English -language monthly comics magazine for children) over 4 years and took over as magazines editor in 2011 This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "15",
            "title": "Clean and Green Innovation | Samit Choksi | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/XOJAP3prlV0",
            "speaker": "Samit Choksi",
            "date": "26-03-2017",
            "views": "3,289 views",
            "likes": "47",
            "description": "Mr. Samit Choksi, the founder of Ulta Chaata, discusses the significance of green technology and how to design an efficient green product. Samit Choksi is the Co-founder of Thinkphi a clean technology company innovating sustainable engineered products that help intelligently conserve water, energy, and waste. Prior to this Samit has co-founded and worked at various start-ups in India and Silicon Valley as a software architect and developer. He has worked closely on product development at a Fortune 500 data base technology company while living in the USA. Spending most of his life outside India, upon moving back he was motivated to build products that aspire to have global standards in quality and finish. With a love for nature and the environment, he is currently realizing his dream of building simple but intelligent products that influence user behavior to conserve earth's natural resources. Thinkphi's first product, Thinkphi is a patented system which smartly converges water harvesting and renewable energy for open spaces in smart cities, industries, or large campuses. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        },
        {
            "sno": "16",
            "title": "Are we fed lies regarding our ancient scriptures and religion? | Sanjeev Newar | TEDxIITIndore",
            "link": "https://www.youtube.com/embed/wj1h8Tc8l-g",
            "speaker": "Sanjeev Newar",
            "date": "26-03-2017",
            "views": "25,931 views",
            "likes": "1.1K",
            "description": "Caste discrimination is a non-existent issue for almost all Indians. Same with gender discrimination and Terrorism. All we need to do is to proactively spread the message of Input Data - the source - and eliminate the intermediate processing errors. Remove whatever outliers or exceptions that exist. He is an MBA graduate from IIM Calcutta and engineering undergrad from IIT Guwahati - two of the most respected institutions of India. Professionally he is an expert in Analytics and Risk Management. In past 14 years of his career, he has undertaken several projects of social, national and global importance. He is also associated with IIT Kanpur in nurturing budding entrepreneurs and indigenous innovation from grass-root level. He is the CEO of Aarsh Management which was listed in 20 Most Promising Risk Management Solution Providers of the world by CIO Review. This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx"
        }
    ],


    "carousel":[
        {
            "link":"/1.jpg",
            "title":"hello",
            "description":"hello"
        },
        {
            "link":"/2.jpg",
            "title":"hello",
            "description":"hello"
        }

    ],

    "gallery":[
        {
            "link":"/1.jpg"
        },
        {
            "link":"/2.jpg"
        }
    ]
}